#+TITLE: vlaci's Emacs configuration

This repository is written using literate programming. All code necessary to develop it and run Emacs is generated from this =README=.

* How-to

This repository uses [[https://github.com/direnv/direnv][direnv]] together with [[https://github.com/target/lorri][lorri]] to automatically create a development shell. It is an optional tool, just using =nix develop= works as well. To help running common development tasks, the following [[https://github.com/casey/just][just]] is needed.

You can see what commands are available with their short description by running =just help=:
#+begin_src sh :tangle no :results output :wrap example :exports results
  just help
#+end_src

#+RESULTS:
#+begin_example
Available recipes:
    help   # Print help
    try
    tangle
#+end_example

